app/Models/UsersModel.php

SELECT `idUser`, `userName`, `userLogin`, `userPassword`
FROM `tbUsers`
WHERE `userLogin` = 'teste'
AND `tbUsers`.`deleted_at` IS NULL
 LIMIT 1
---
    public function getByUserLogin(string $userLogin)
    {
        $rq =  $this->select('idUser, userName, userLogin, userPassword')
            ->where('userLogin', $userLogin)
            ->first();