app/Models/UsersModel.php

    public function getByUserLogin(string $userLogin): array
    {
        $rq =  $this->where('userLogin', $userLogin)->first();
---
SELECT *
FROM `tbUsers`
WHERE `userLogin` = 'teste'
AND `tbUsers`.`deleted_at` IS NULL
 LIMIT 1